Revit 2026 API

# CableSize Properties

---

The CableSize type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Comments | The comments of this Cable Size. |
|  | GroundConductorSize | The size of a Ground Conductor. |
|  | HotConductorSize | The size of a Hot Conductor. |
|  | Id | The Cable Size id. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The name of this Cable Size. |
|  | NeutralConductorSize | The size of a Neutral Conductor. |
|  | NumberOfGroundConductors | The number of Ground Conductors. |
|  | NumberOfHotConductors | The number of Hot Conductors. |
|  | NumberOfNeutralConductors | The number of Neutral Conductors. |
|  | NumberOfOtherConductors | The number of Other Conductors. |
|  | OtherConductorSize | The size of an Other Conductor. |

#### Reference

CableSize Class

Autodesk.Revit.DB.Electrical Namespace